Repository: alff0x1f/kolco24-ios
Catalog: kolco24/Localizable.xcstrings
Source language: ru
Languages: en

# admin.action.bindCpChip
source: Привязать чип к КП
en: Bind chip to CP

# admin.action.bindCpChip.sub
source: Запись кода на чип
en: Write the code to the chip

# admin.action.checkCpChip
source: Проверить чип КП
en: Check CP chip

# admin.action.checkCpChip.sub
source: Оффлайн-проверка привязки
en: Offline binding check

# admin.action.checkWristband
source: Проверить браслет
en: Check wristband

# admin.action.checkWristband.sub
source: Оффлайн-проверка браслета
en: Offline wristband check

# admin.action.writeWristband
source: Записать браслет
en: Write wristband

# admin.action.writeWristband.sub
source: Запись кода на браслет
en: Write the code to the wristband

# admin.actions
source: Действия
en: Actions

# admin.chooseTeamHint
source: Выберите команду на вкладке «Команда», чтобы открыть судейские действия — гонка определяется по выбранной команде.
en: Choose a team on the Team tab to open the judge actions — the race is taken from the selected team.

# admin.login.enableLocalMode
source: Включите локальный режим гонки
en: Turn on the race local mode

# admin.login.error.invalidCredentials
source: Неверный email или пароль
en: Wrong email or password

# admin.login.error.offline
source: Нет соединения с сервером
en: No connection to the server

# admin.login.error.other
source: Не удалось войти. Попробуйте ещё раз
en: Couldn't sign in. Try again

# admin.login.error.rateLimited
source: Слишком много попыток входа. Попробуйте позже
en: Too many sign-in attempts. Try again later

# admin.login.hidePassword
source: Скрыть пароль
en: Hide password

# admin.login.password
source: Пароль
en: Password

# admin.login.showPassword
source: Показать пароль
en: Show password

# admin.login.title.cloud
source: Вход на cloud-сервер
en: Sign in to the cloud server

# admin.login.title.lan
source: Вход на LAN-сервер гонки
en: Sign in to the race LAN server

# admin.login.title.organizer
source: Вход организатора
en: Organizer sign-in

# admin.noRights
source: Нет прав администратора на эту гонку
en: No admin rights for this race

# admin.noSession.cloud
source: Нет входа на cloud-сервер
en: Not signed in to the cloud server

# admin.noSession.lan
source: Нет входа на LAN-сервер
en: Not signed in to the LAN server

# admin.recent
source: Недавние · %lld
en: Recent · %lld

# admin.row.cloudOnly
source: %@ · только Cloud
en: %@ · Cloud only

# admin.row.lanOnly
source: %@ · только LAN
en: %@ · LAN only

# admin.row.signIn
source: Войти
en: Sign in

# admin.scan
source: Сканировать
en: Scan

# admin.section.cpChips
source: Чипы КП
en: CP chips

# admin.section.judgeScans
source: Судейские отметки
en: Judge scans

# admin.section.wristbands
source: Браслеты участников
en: Participant wristbands

# admin.signOut
source: Выйти
en: Sign out

# admin.signedIn
source: Вход выполнен
en: Signed in

# admin.status.cpChip
source: Это чип КП
en: This is a CP chip

# admin.status.enableLocalMode
source: включите локальный режим гонки
en: turn on the race local mode

# admin.status.holdWristband
source: Приложите браслет
en: Hold a wristband

# admin.status.notSignedIn
source: нет входа
en: not signed in

# admin.status.unknownChip
source: Неизвестный чип
en: Unknown chip

# admin.status.waiting
source: Ожидание
en: Waiting

# bindChip.bound.title
source: Чип привязан
en: Chip bound

# bindChip.foreign.body
source: Этот чип не зарегистрирован для гонки. Привязка не сохранена.
en: This chip isn't registered for the race. Binding not saved.

# bindChip.foreign.title
source: Чип не из этого комплекта
en: Chip is not from this set

# bindChip.holdChip.body
source: Браслет участника нужно поднести к задней панели телефона.
en: Hold the participant wristband to the back of the phone.

# bindChip.holdChip.title
source: Поднесите чип к телефону
en: Hold the chip to the phone

# bindChip.loading.body
source: Данные ещё не загружены. Поднесите чип снова через несколько секунд.
en: Data isn't loaded yet. Hold the chip again in a few seconds.

# bindChip.loading.title
source: Загружаем список участников
en: Loading participants

# bindChip.rebind
source: Перепривязать
en: Rebind

# bindChip.taken.body
source: Этот чип закреплён за другим участником. Перепривязать его к «%@»?
en: This chip belongs to another participant. Rebind it to “%@”?

# bindChip.taken.title
source: Чип уже привязан
en: Chip already bound

# bindChip.title
source: ПРИВЯЗАТЬ ЧИП
en: BIND CHIP

# checkChip.blank
source: Чистый чип
en: Blank chip

# checkChip.blank.detail
source: Кода КП не прочитано
en: No CP code read

# checkChip.boundCorrectly
source: Привязан корректно
en: Bound correctly

# checkChip.loadingLegend
source: Загрузка легенды…
en: Loading legend…

# checkChip.mismatch.detail
source: bid %1$@ → КП id %2$@ отсутствует
en: bid %1$@ → CP id %2$@ is missing

# checkChip.mismatch.short
source: Рассинхрон
en: Mismatch

# checkChip.mismatch.title
source: Рассинхрон легенды
en: Legend mismatch

# checkChip.othersOnCp
source: На этом КП ещё %lld чипов
en: %lld more chips on this CP

# checkChip.title
source: Проверка чипов КП
en: CP chip check

# checkChip.unknown.detail
source: bid %@ — нет в этой гонке
en: bid %@ — not in this race

# checkMemberChip.codeWritten
source: код записан
en: code written

# checkMemberChip.inPool
source: Участник в пуле
en: Participant is in the pool

# checkMemberChip.noCode
source: без кода
en: no code

# checkMemberChip.title
source: Проверка браслетов
en: Wristband check

# chip.model.ntagUnknown
source: NTAG (неизвестно)
en: NTAG (unknown)

# chip.model.unknown
source: неизвестно
en: unknown

# chip.write.failed
source: Ошибка записи
en: Write error

# chip.write.pageRejected
source: Метка отклонила запись страницы %@
en: The tag rejected writing page %@

# chip.write.verifyMismatch
source: Чтение после записи не совпало
en: Read-back after write did not match

# clock.banner.skewed
source: Часы телефона расходятся с сервером на %@ — проверьте дату и время
en: The phone clock differs from the server by %@ — check the date and time

# clock.banner.unconfirmedJudge
source: Время не подтверждено — синхронизируйте до начала работы
en: Time not confirmed — sync before you start

# clock.banner.unconfirmedParticipant
source: Время не подтверждено — подключитесь к сети. Отметка всё равно будет сохранена.
en: Time not confirmed — connect to the network. The punch will still be saved.

# common.back
source: Назад
en: Back

# common.binding
source: Привязка на сервере…
en: Binding on the server…

# common.bytes.b
source: Б
en: B

# common.bytes.gb
source: ГБ
en: GB

# common.bytes.kb
source: КБ
en: KB

# common.bytes.mb
source: МБ
en: MB

# common.cancel
source: Отмена
en: Cancel

# common.change
source: Изменить
en: Change

# common.chooseTeam
source: Выбрать команду
en: Choose team

# common.clear
source: Очистить
en: Clear

# common.close
source: Закрыть
en: Close

# common.cp
source: КП
en: CP

# common.cp.number
source: КП %@
en: CP %@

# common.delete
source: Удалить
en: Delete

# common.done
source: Готово
en: Done

# common.duration.hoursMinutes
source: %1$lld ч %2$@ мин
en: %1$lld h %2$@ min

# common.duration.minutes
source: %lld мин
en: %lld min

# common.error
source: Ошибка
en: Error

# common.error.prefixed
source: Ошибка: %@
en: Error: %@

# common.loading
source: Загрузка…
en: Loading…

# common.openSettings
source: Открыть настройки
en: Open Settings

# common.points.count
source: %lld баллов
en: %lld points

# common.retry
source: Повторить
en: Retry

# compPicker.currentBadge
source: ТЕКУЩЕЕ
en: CURRENT

# compPicker.empty
source: Здесь пока пусто
en: Nothing here yet

# compPicker.filter.archive
source: Архив · %lld
en: Archive · %lld

# compPicker.filter.current
source: Актуальные · %lld
en: Current · %lld

# compPicker.hint
source: Выберите соревнование — откроется список его команд.
en: Choose a race to see its teams.

# compPicker.month.apr
source: АПР
en: APR

# compPicker.month.aug
source: АВГ
en: AUG

# compPicker.month.dec
source: ДЕК
en: DEC

# compPicker.month.feb
source: ФЕВ
en: FEB

# compPicker.month.jan
source: ЯНВ
en: JAN

# compPicker.month.jul
source: ИЮЛ
en: JUL

# compPicker.month.jun
source: ИЮН
en: JUN

# compPicker.month.mar
source: МАР
en: MAR

# compPicker.month.may
source: МАЙ
en: MAY

# compPicker.month.nov
source: НОЯ
en: NOV

# compPicker.month.oct
source: ОКТ
en: OCT

# compPicker.month.sep
source: СЕН
en: SEP

# compPicker.title
source: Соревнование
en: Race

# controlTime.label.finished
source: Время
en: Time

# controlTime.label.limit
source: КВ
en: Time limit

# controlTime.label.overtime
source: Опоздание
en: Late

# controlTime.label.remaining
source: До КВ
en: Time left

# judge.finish.sub
source: Сканировать браслеты на финише
en: Scan wristbands at the finish

# judge.hint
source: Прикладывайте браслеты участников
en: Hold participant wristbands to the phone

# judge.poolMissing
source: Пул браслетов ещё не загружен — отметки не распознаются.
en: Wristband pool not loaded yet — check-ins won't be recognized.

# judge.start.sub
source: Сканировать браслеты на старте
en: Scan wristbands at the start

# judge.status.recorded
source: Отметка записана
en: Check-in recorded

# judge.syncRace
source: Синхронизируйте гонку
en: Sync the race

# judge.title.finish
source: Отметка финиша
en: Finish check-in

# judge.title.start
source: Отметка старта
en: Start check-in

# legend.descriptionHidden
source: Описание скрыто
en: Description hidden

# legend.filter.all
source: Все
en: All

# legend.filter.open
source: Не взятые
en: Not taken

# legend.header.taken
source: %lld КП
en: %lld CPs

# legend.header.takenOfTotal
source: %1$lld/%2$lld КП
en: %1$lld/%2$lld CPs

# legend.locked.count
source: Скрыто %lld КП
en: %lld CPs hidden

# legend.locked.hint
source: Стоимость и описания КП появятся позже
en: CP points and descriptions will appear later

# localMode.dataStaleSuffix
source: (данные не обновлены)
en: (data not updated)

# localMode.subtitle.cloud
source: Обновление из интернета
en: Updates from the internet

# localMode.toast.cloudUpdated
source: Обновлено из интернета
en: Updated from the internet

# localMode.toast.localUnreachable
source: Локальный сервер недоступен
en: Local server unavailable

# localMode.toast.noRace
source: Гонка не выбрана
en: No race selected

# localMode.toast.offline
source: Нет сети
en: No connection

# localMode.until
source: Локальный режим до %@
en: Local mode until %@

# map.allPoints
source: Все точки
en: All points

# map.camera.myLocation
source: Моё местоположение
en: My location

# map.camera.raceMap
source: Показать карту гонки
en: Show race map

# map.cp.callout
source: КП %1$@ · %2$@ · %3$@
en: CP %1$@ · %2$@ · %3$@

# map.download.action
source: Скачать карту гонки
en: Download race map

# map.download.failed
source: Не удалось скачать карту гонки
en: Couldn't download the race map

# map.download.hint
source: Скачается один раз по Wi-Fi — дальше карта работает офлайн.
en: Downloads once over Wi-Fi — then the map works offline.

# map.download.progress
source: Скачивание карты…
en: Downloading map…

# map.speed.legendLabel
source: Цвет трека по скорости
en: Track color by speed

# map.speed.unit
source: км/ч
en: km/h

# map.stop.title
source: Стоянка %@
en: Stop %@

# map.toast.locationUnknown
source: Местоположение ещё не определено
en: Location not determined yet

# map.unavailable
source: Оффлайн-карта для этой гонки недоступна
en: No offline map for this race

# marks.action.photo
source: Фото
en: Photo

# marks.empty.chooseTeamFirst
source: Сначала выберите команду
en: Choose a team first

# marks.empty.noTeam.body
source: Отметки на КП засчитываются по NFC-чипам участников. Выберите команду, чтобы отмечаться на дистанции и видеть общий счёт.
en: CP punches are counted by the participants' NFC chips. Choose a team to punch on the course and see the total score.

# marks.empty.noTeam.title
source: Команда не выбрана
en: No team selected

# marks.empty.teamGone.body
source: Выбранная команда снялась или удалена из списка. Выберите команду заново, чтобы продолжить отмечаться.
en: The selected team withdrew or was removed. Choose a team again to keep punching.

# marks.empty.teamGone.title
source: Команда больше не зарегистрирована
en: Team is no longer registered

# marks.metric.score
source: Баллов
en: Points

# marks.metric.taken
source: Взято КП
en: CPs taken

# marks.nfcUnavailable.detail
source: · отметка чипом не сработает, отмечайтесь фото
en: · chip punches won't work, use photos

# marks.nfcUnavailable.title
source: NFC недоступен
en: NFC unavailable

# marks.photoReview.subtitle
source: Баллы засчитают после проверки судьями
en: Points will count after the judges review

# marks.photoReview.title
source: %1$lld КП по фото (%2$@)
en: Photo CPs: %1$lld (%2$@)

# marks.photoReview.titleWithPoints
source: %1$lld КП по фото (%2$@) · %3$@
en: Photo CPs: %1$lld (%2$@) · %3$@

# marks.readiness.title
source: Готовность к старту
en: Start readiness

# marks.ready.body
source: Приложите телефон к метке КП — отметка появится здесь.
en: Hold your phone to a CP tag — the punch will appear here.

# marks.ready.title
source: Всё готово к старту
en: Ready to start

# marks.scoreHidden
source: Взято, баллы пока скрыты
en: Taken, points hidden for now

# marks.unconfirmed.subtitle
source: Отметьтесь на КП ещё раз при наличии связи
en: Punch the CP again when you have a connection

# marks.unconfirmed.title
source: Не подтверждены сервером (%1$lld): %2$@
en: Not confirmed by the server (%1$lld): %2$@

# memberProvisioning.card.next
source: Можно прикладывать следующий браслет
en: Ready for the next wristband

# memberProvisioning.card.notFound
source: Браслет %@ не найден
en: Wristband %@ not found

# memberProvisioning.card.number
source: Номер %@
en: Number %@

# memberProvisioning.card.tapOne
source: Тап 1 — получение кода с сервера
en: Tap 1 — get the code from the server

# memberProvisioning.card.tapTwo
source: Тап 2 — запись кода, участник №%@
en: Tap 2 — write the code, participant #%@

# memberProvisioning.card.tapWristband
source: Приложите браслет к телефону
en: Hold the wristband to the phone

# memberProvisioning.error.conflict
source: Браслет уже привязан к другому участнику
en: Wristband is already bound to another participant

# memberProvisioning.error.notFound
source: Не найдено на сервере
en: Not found on the server

# memberProvisioning.hint.sameWristband
source: Приложите тот же браслет
en: Hold the same wristband

# memberProvisioning.loadingPool
source: Загрузка браслетов…
en: Loading wristbands…

# memberProvisioning.numberField
source: Номер
en: Number

# memberProvisioning.poolSize
source: Браслетов в базе: %lld
en: Wristbands in the database: %lld

# memberProvisioning.sessionCount
source: Записано в этой сессии: %lld
en: Written this session: %lld

# memberProvisioning.status.enterNumber
source: Введите номер участника
en: Enter the participant number

# memberProvisioning.status.tapWristband
source: Приложите браслет участника
en: Hold the participant wristband

# memberProvisioning.status.written
source: Записано: №%@
en: Written: #%@

# memberProvisioning.title
source: Браслет участника
en: Participant wristband

# nfc.alert.tapCpChip
source: Приложите чип КП
en: Hold your phone to the CP chip

# photo.camera.denied.body
source: Чтобы сфотографировать КП, разрешите доступ к камере в настройках приложения.
en: To photograph a CP, allow camera access in the app settings.

# photo.camera.denied.title
source: Нужен доступ к камере
en: Camera access needed

# photo.capture.change
source: изменить
en: change

# photo.capture.done
source: Готово (%lld)
en: Done (%lld)

# photo.discard.message
source: Снятые кадры (%lld) не будут сохранены.
en: The photos taken (%lld) will not be saved.

# photo.discard.title
source: Удалить снимки?
en: Delete photos?

# photo.lightbox.unconfirmed
source: не подтверждён сервером
en: not confirmed by the server

# photo.picker.erase
source: Стереть номер
en: Erase number

# photo.picker.error.notInLegend
source: КП с таким номером нет в легенде
en: No CP with this number in the legend

# photo.picker.hint.empty
source: Номер написан на табличке КП
en: The number is on the CP sign

# photo.picker.hint.exact
source: Нажмите на КП, чтобы открыть камеру
en: Tap the CP to open the camera

# photo.picker.hint.noMatch
source: В легенде нет КП %@
en: No CP %@ in the legend

# photo.picker.hint.partial
source: Введите номер полностью или выберите из списка
en: Enter the full number or pick from the list

# photo.picker.numberField
source: Номер КП
en: CP number

# photo.picker.openCamera
source: Открыть камеру
en: Open camera

# photo.picker.title
source: Фото КП
en: CP photo

# provisioning.alreadyBound
source: Уже привязано: %lld
en: Already bound: %lld

# provisioning.card.next
source: Переход к следующему КП
en: Moving to the next CP

# provisioning.card.tapChip
source: Приложите чип к телефону
en: Hold the chip to the phone

# provisioning.card.tapOne
source: Тап 1 — привязка чипа к этому КП
en: Tap 1 — bind the chip to this CP

# provisioning.card.tapTwo
source: Тап 2 — запись кода на чип
en: Tap 2 — write the code to the chip

# provisioning.error.badRequest
source: Неверный запрос
en: Invalid request

# provisioning.error.badServerCode
source: Неверный код от сервера
en: Invalid code from the server

# provisioning.error.conflict
source: Этот тег уже привязан к другому КП
en: This tag is already bound to another CP

# provisioning.error.cpNotFound
source: КП не найдено
en: CP not found

# provisioning.error.forbidden
source: Нет прав администратора этой гонки или ошибка подписи/часов
en: No admin rights for this race, or a signature/clock error

# provisioning.error.offline
source: Нет сети, попробуйте снова
en: No connection, try again

# provisioning.error.rateLimited
source: Слишком часто, подождите немного
en: Too many requests, wait a little

# provisioning.error.server
source: Ошибка сервера
en: Server error

# provisioning.error.unauthorized
source: Сессия истекла, войдите снова
en: Session expired, sign in again

# provisioning.hint.sameChip
source: Приложите тот же чип
en: Hold the same chip

# provisioning.loadingCps
source: Загрузка КП…
en: Loading CPs…

# provisioning.message.cpChipNotWristband
source: Это чип КП, а не браслет
en: This is a CP chip, not a wristband

# provisioning.message.cpWriteAgain
source: Приложите чип ещё раз
en: Hold the chip again

# provisioning.message.isWristband
source: Это браслет участника
en: This is a participant wristband

# provisioning.message.otherChipType
source: Чип другого типа
en: Chip of another type

# provisioning.message.readFailedTapAgain
source: Не удалось прочитать, приложите снова
en: Couldn't read, hold it again

# provisioning.message.wristbandWriteAgain
source: Приложите браслет ещё раз
en: Hold the wristband again

# provisioning.message.writeFailedTapAgain
source: Не удалось записать, приложите снова
en: Couldn't write, hold it again

# provisioning.noCps
source: В легенде нет КП
en: No CPs in the legend

# provisioning.status.tapChip
source: Приложите чип
en: Hold the chip

# provisioning.status.tapCpChip
source: Приложите чип КП
en: Hold the CP chip

# provisioning.status.written
source: Записано: КП %@
en: Written: CP %@

# provisioning.syncHint
source: Синхронизируйте гонку на вкладке «Легенда»
en: Sync the race on the Legend tab

# provisioning.title
source: Привязка чипов
en: Chip binding

# readiness.chips.bound.title
source: Чипы привязаны
en: Chips bound

# readiness.chips.boundOfTotal
source: %1$lld из %2$lld
en: %1$lld of %2$lld

# readiness.chips.noRoster.detail
source: Без участников отметка не сработает — обновите данные
en: Punches won't work without team members — refresh the data

# readiness.chips.noRoster.title
source: Состав команды не загружен
en: Team roster not loaded

# readiness.chips.noTeam.detail
source: Сначала выберите команду
en: Choose a team first

# readiness.chips.noTeam.title
source: Чипы не привязаны
en: Chips not bound

# readiness.chips.partial.title
source: Чипы привязаны не всем
en: Not all chips bound

# readiness.clock.noSync.detail
source: Нет связи с сервером — время отметок берётся с телефона
en: No server connection — punch times come from the phone

# readiness.clock.noSync.title
source: Часы не синхронизированы
en: Clock not synced

# readiness.clock.ok.detail
source: Время совпадает с судейским
en: Time matches the judges' clock

# readiness.clock.ok.title
source: Часы синхронизированы
en: Clock synced

# readiness.clock.skewed.detail
source: Расхождение с судейским временем — %@
en: Differs from the judges' clock by %@

# readiness.clock.skewed.title
source: Часы расходятся
en: Clock is off

# readiness.legend.cpCount
source: %lld КП
en: %lld CPs

# readiness.legend.loaded.title
source: Легенда загружена
en: Legend loaded

# readiness.legend.missing.detail
source: Нажмите, чтобы обновить данные
en: Tap to refresh the data

# readiness.legend.missing.title
source: Легенда не загружена
en: Legend not loaded

# readiness.location.denied.detail
source: Доступ запрещён — включите в Настройках
en: Access denied — turn it on in Settings

# readiness.location.granted.detail
source: Точная геопозиция
en: Precise location

# readiness.location.granted.title
source: Геолокация разрешена
en: Location allowed

# readiness.location.notDetermined.detail
source: Доступ не запрошен — нажмите, чтобы разрешить
en: Not requested yet — tap to allow

# readiness.location.reduced.detail
source: Дана примерная локация — включите точную геопозицию
en: Approximate location only — turn on Precise Location

# readiness.location.title
source: Геолокация
en: Location

# readiness.map.missing.detail
source: Скачайте подложку заранее — в лесу может не быть связи
en: Download the map in advance — there may be no signal in the forest

# readiness.map.missing.title
source: Карта не скачана
en: Map not downloaded

# readiness.map.ready.detail
source: Подложка доступна оффлайн
en: Map is available offline

# readiness.map.ready.title
source: Карта скачана
en: Map downloaded

# readiness.power.detail
source: Фоновая запись трека может прерываться — выключите в Настройках → Аккумулятор
en: Background track recording may stop — turn it off in Settings → Battery

# readiness.power.title
source: Включено энергосбережение
en: Low Power Mode is on

# readiness.team.missing.detail
source: Выберите соревнование и команду
en: Choose a race and a team

# readiness.team.missing.title
source: Команда не выбрана
en: No team selected

# readiness.team.selected.title
source: Команда выбрана
en: Team selected

# refresh.error.forbidden
source: Доступ запрещён
en: Access denied

# refresh.error.http
source: Ошибка сервера (%@)
en: Server error (%@)

# refresh.error.offline
source: Нет сети — не удалось обновить
en: No connection — couldn't refresh

# scan.allMembersPunched
source: Все участники отмечены
en: All team members punched

# scan.anyOrder
source: Сканировать чипы можно в любом порядке
en: You can scan the chips in any order

# scan.badKp.decryptFailed
source: не удалось расшифровать
en: could not decrypt

# scan.badKp.noLegend
source: легенда не загружена
en: legend not loaded

# scan.badKp.noTeam
source: команда не выбрана
en: no team selected

# scan.badKp.unknownChip
source: неизвестный чип
en: unknown chip

# scan.cancel
source: Отменить
en: Cancel

# scan.chip.none
source: Нет чипа
en: No chip

# scan.chip.number
source: Чип %@
en: Chip %@

# scan.cpNotScanned
source: КП не отсканирован
en: CP not scanned

# scan.cpTag
source: Метка КП
en: CP tag

# scan.diagnostic.unboundChip
source: Чип не привязан к команде
en: Chip is not bound to the team

# scan.holdToCpChip
source: Поднесите телефон к чипу на КП
en: Hold your phone to the chip on the CP

# scan.status.progress
source: КП %1$@ · чипы %2$lld/%3$lld
en: CP %1$@ · chips %2$lld/%3$lld
